export const privacyVersionDateList: {
  seq: number;
  version: string;
  date: string;
}[] = [
  {
    seq: 1,
    version: 'v2.0',
    date: '2023-01-01',
  },
];

export const privacyContent: {
  [key: number]: {
    contents: {
      styleClass: string;
      value: string;
    }[];
  };
} = {
  1: {
    contents: [
      {
        styleClass: '',
        value: `고운황금손산후도우미(이하 "고운황금손"이라 함)는 "정보통신망 이용촉진 및 정보보호 등에 관한 법률"(이하 “정통망법”이라 함)등 모든 관련법규를 준수하며
회원님의 개인정보가 보호받을 수 있도록 최선을 다하고 있습니다.`,
      },
      {
        styleClass: '',
        value: `회사는 개인정보취급방침의 공개를 통하여 회원 여러분의 개인정보가 어떠한 목적과
방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지를 알려드립니다.`,
      },
      {
        styleClass: '',
        value: `본 개인정보취급방침은 관련법령의 개정이나 당사 내부방침에 의해 변경될 수 있으며 회원 가입 시나 사이트 이용 시에 수시로 확인하여 주시기 바랍니다.`,
      },
      {
        styleClass: 'pt-6 text-black font-semibold',
        value: `'고운황금손'의 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.`,
      },
      {
        styleClass: '',
        value: `가. 수집하는 개인정보 항목 및 수집방법`,
      },
      {
        styleClass: '',
        value: `나. 개인정보의 수집 및 이용목적`,
      },
      {
        styleClass: '',
        value: `다. 개인정보취급 위탁`,
      },
      {
        styleClass: '',
        value: `라. 수집한 개인정보의 보유 및 이용기간`,
      },
      {
        styleClass: '',
        value: `마. 개인정보 동의철회 및 파기`,
      },
      {
        styleClass: '',
        value: `바. 개인정보의 열람, 갱신, 수정 또는 삭제`,
      },
      {
        styleClass: '',
        value: `사. 개인정보 자동 수집 장치의 설치/운영 및 그 거부에 관한 사항`,
      },
      {
        styleClass: '',
        value: `아. 개인정보 관리책임자 및 담당자의 소속-성명 및 연락처`,
      },
      {
        styleClass: '',
        value: `자. 방침변경 등에 대한 고지`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `가. 수집하는 개인정보 항목 및 수집방법`,
      },
      {
        styleClass: '',
        value: `① '고운황금손'은 회원가입, 상담, 서비스 신청 등을 위해 아래와 같은 개인정보를 수집하고 있습니다.`,
      },
      {
        styleClass: '',
        value: `· 이름,이메일, 생년월일, 주소, 연락처, 핸드폰 번호.`,
      },
      {
        styleClass: 'pt-6',
        value: `또한 서비스 이용과정이나 사업 처리 과정에서 아래와 같은 정보들이 생성되어 수집될 수 있습니다.`,
      },
      {
        styleClass: '',
        value: `· 서비스 이용기록,접속 로그, 쿠키, 접속 IP 정보, 결제기록, 이용정지 기록`,
      },
      {
        styleClass: 'pt-6',
        value: `② '고운황금손'은 다음과 같은 방법으로 개인정보를 수집합니다.`,
      },
      {
        styleClass: '',
        value: `· 홈페이지,서면양식, 전화 및 팩스를 통한 회원가입, 상담 게시판, 경품 행사응모, 배송 요청`,
      },
      {
        styleClass: '',
        value: `· 제휴사로부터의 제공`,
      },
      {
        styleClass: '',
        value: `· 생성정보 수집 툴을 통한 수집`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `나. 개인정보 수집 및 이용목적`,
      },
      {
        styleClass: '',
        value: `'고운황금손'은 수집한 개인정보를 다음의 목적을 위해 활용합니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `① 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산`,
      },
      {
        styleClass: '',
        value: `· 콘텐츠 제공, 물품배송 또는 청구서 등 발송, 금융거래 본인 인증 및 금융 서비스, 구매 및 요금 결재, 요금추심`,
      },
      {
        styleClass: 'pt-6',
        value: `② 회원 관리`,
      },
      {
        styleClass: '',
        value: `· 회원제 서비스 이용에 따른 본인확인, 개인식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 가입 및 가입횟수 제한, 만14세 미만 아동`,
      },
      {
        styleClass: '',
        value: `· 개인정보 수집 시 법정 대리인 동의여부 확인, 추후 법정 대리인 본인확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달`,
      },
      {
        styleClass: 'pt-6',
        value: `③ 마케팅 및 광고에 활용`,
      },
      {
        styleClass: '',
        value: `· 신규 서비스(제품) 개발 및 특화, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악, 회원의 서비스 이용에 대한 통계, 이벤트 등 광고성
    정보 전달`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `다. 수집한 개인정보 취급 위탁`,
      },
      {
        styleClass: '',
        value: `'고운황금손'은 고객님의 동의없이 고객님의 개인정보 취급을 외부 업체에 위탁하지 않습니다.`,
      },
      {
        styleClass: '',
        value: `향후 그러한 필요가 생길 경우, 위탁 대상자와 위탁 업무 내용에 대해 고객님에게 통지하고 필요한 경우 사전 동의를 받도록 하겠습니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `라. 수집한 개인정보의 보유 및 이용기간`,
      },
      {
        styleClass: '',
        value: `① 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 따라 동법 시행일인 2012년 8월 18일부터 2년 내에 보유하고 있는 주민등록번호는 파기하고,
    2015년 8월 18일 기준 과거 1년간 사이트를 이용하지 아니한 회원의 개인정보는 파기되거나 별도 분리되어 보관됩니다. 그럼에도 회원님이 그 보유기간을
    별도로 지정하거나, 법률에 근거하여 보존할 필요가 있는 경우는 기존과 같이 안전 관리를 다하여 보관합니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `② 회원님의 개인정보는 다음과 같이 개인정보의 수집목적 또는 제공받은 목적이 달성되면 파기됩니다. 다만, 전자상거래 등에서의 소비자보호에 관한 법률 등
    관련법령에 의해 보존할 의무가 있는 경우에는 법령에서 정한 최소한의 기간동안 별도 보관되며, 보관목적으로만 이용합니다.`,
      },
      {
        styleClass: '',
        value: `· 회원님이 보관기간을 별도 요청하는 경우 그 기간만큼(다만 법령의 최소보존 기간 미만으로 지정할 수 없음)보관할 수 있습니다. 또한 고객의 안전과
     피해방지를 위해 회원 탈퇴 후 최소한의 정보는 서비스 이용의 혼선 방지, 명의도용 등 불, 편법 행위의 방지 및 대응의 목적으로 회원탈퇴 후 1년간 별도
     보관합니다.`,
      },
      {
        styleClass: '',
        value: `· 회원가입정보의 경우, 회원 탈퇴하거나 회원에서 제명된 경우에는 사전에 보유목적, 기간 및 보유하는 개인정보 항목을 명시하여 동의를 구합니다.`,
      },
      {
        styleClass: '',
        value: `- 계약 또는 청약철회 등에 관한 기록: 5년`,
      },
      {
        styleClass: '',
        value: `- 대금결제 및 재화 등의 공급에 관한 기록: 5년`,
      },
      {
        styleClass: '',
        value: `- 소비자의 불만 또는 분쟁처리에 관한 기록: 3년`,
      },
      {
        styleClass: 'pt-6',
        value: `③ 회원님의 동의를 받아 보유하고 있는 거래정보 등을 회원님께서 열람을 요구하는 경우에는 소정의 본인확인절차를 거친 후 지체 없이 열람, 확인할 수 있도록 조치합니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `마. 개인정보 동의철회 및 파기`,
      },
      {
        styleClass: '',
        value: `회원가입 등을 통한 개인정보의 수집, 이용, 제공에 대하여 회원은 가입 시 동의한 내용에 대해서 언제든지 철회할 수 있습니다. 동의 철회는 당사의 사이트에 
로그인 후, "마이페이지>회원탈퇴하기"에서 언제든지 철회할 수 있으며, 개인정보 관리책임자에게 서면, 전화, e-mail 등으로 연락하시면 신속하게 개인정보의 
삭제 등 필요한 조치를 합니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `단, 회원 ID에 대해서는 서비스 이용의 혼선 방지, 법령에서 규정하는 회원거래정보의 보존기간 동안의 보관의무의 이행, 기타 안정적인 서비스 제공을 위하여 필요한 정보이므로 탈퇴 후 동일 ID로의 재가입은 허용되지 않습니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `이미 제공된 회원정보를 철회하는 데는 일정 시간이 소요되며 소요되는 시간 동안 마케팅에 활용되지 않도록 하겠습니다. 회사는 회원님의 소중한 정보를 보호하기 위하여 신속하게 처리되도록 최선의 노력을 다하겠습니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `바. 개인정보의 열람, 갱신, 수정 또는 삭제`,
      },
      {
        styleClass: '',
        value: `① 회원님께서는 언제든지 등록되어 있는 회원님의 개인정보를 열람하거나 수정하실 수 있습니다. 개인정보 열람 및 정정을 하고자 할 경우에는 홈페이지에서
    로그인 후 "회원>회원정보확인"항목을 클릭하여 직접 열람 또는 정정하거나, 개인정보관리책임자에게 서면, 전화 또는 E-mail로 연락하시면 지체 없이
    조치하겠습니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `② 회원님께서 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 해당 개인 정보를 이용 또는 제공하지 않습니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `③ 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정하도록 조치하겠습니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `사.개인정보의 자동 수집 장치의 설치/운영 및 그 거부에 관한 사항`,
      },
      {
        styleClass: '',
        value: `'고운황금손'은 귀하의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’등 개인정보를 자동으로 수집하는 장치를 설치/운용합니다.`,
      },
      {
        styleClass: '',
        value: `※ 쿠키(cookie)란 '고운황금손'의 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `① '고운황금손'은(는) 다음과 같은 목적을 위해 쿠키 등을 사용합니다.`,
      },
      {
        styleClass: '',
        value: `· 쿠키 등 사용 목적`,
      },
      {
        styleClass: '',
        value: `-회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공`,
      },
      {
        styleClass: 'pt-6',
        value: `② 귀하는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 귀하는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.`,
      },
      {
        styleClass: '',
        value: `· 쿠키 설정 거부 방법`,
      },
      {
        styleClass: '',
        value: `예) 쿠키 설정을 거부하는 방법으로는 회원님이 사용하시는 웹 브라우저의 옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을
      거치거나, 모든 쿠키의 저장을 거부할 수 있습니다.`,
      },
      {
        styleClass: 'pt-6 text-red-500 font-bold',
        value: `※ 단, 귀하께서 쿠키 설정을 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `아. 개인정보 관리 책임자`,
      },
      {
        styleClass: '',
        value: `① ‘고운황금손'은 고객의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.`,
      },
      {
        styleClass: '',
        value: `· 개인정보관리책임자`,
      },
      {
        styleClass: '',
        value: `- 성명 :  윤 재 현 `,
      },
      {
        styleClass: '',
        value: `- 전화번호 : 010-5536-3765 `,
      },
      {
        styleClass: '',
        value: `- 이메일 : nicegold25@naver.com `,
      },
      {
        styleClass: 'pt-6',
        value: `② 회원님께서는 '고운황금손'의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보 관리책임자 혹은 담당부서로 신고하실 수 있습니다.
    회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.`,
      },
      {
        styleClass: 'pt-6 text-[#728146] font-bold',
        value: `자. 방침변경 등에 대한 고지`,
      },
      {
        styleClass: '',
        value: `현 개인정보취급방침은 2025년 06월 26일부터 적용됩니다. 내용의 추가, 삭제 및 수정이 있을 경우에는 시행일의 7일 전부터 웹사이트의 공지사항을 통하여 고지할 것이며 중요한 사항일 경우 시행일 30일전부터 웹사이트의 공지사항을 통한 고지 및 이메일 고지를 할 것입니다.`,
      },
      {
        styleClass: '',
        value: `단, 개인정보 수집 및 활용, 제3자 제공 등이 변경될 경우 별도의 동의를 받겠습니다. 또한 개인정보 취급방침에 버전번호, 변경일자 및 그 시행일자 등을 부여하여 개정여부를 쉽게 알 수 있도록 하고 있습니다.`,
      },
      {
        styleClass: 'pt-6',
        value: `· 개인정보취급방침 버전번호: ver.2.0`,
      },
      {
        styleClass: '',
        value: `· 개인정보취급방침 변경 일자: 2023-01-01`,
      },
      {
        styleClass: '',
        value: `· 개인정보취급방침 시행 일자: 2023-01-11`,
      },
      {
        styleClass: '',
        value: `· 개인정보취급방침 버전번호: ver.2.0`,
      },
    ],
  },
};
